; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_9_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 c8 - counter
	)
  (:init
		(= (value c0) 1)
	(= (value c1) 49)
	(= (value c2) 29)
	(= (value c3) 0)
	(= (value c4) 18)
	(= (value c5) 64)
	(= (value c6) 61)
	(= (value c7) 23)
	(= (value c8) 94)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)
	(= (rate_value c8) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
	(<= (+ (value c7) 1) (value c8))
		)
	)
)

; plan
1. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 4 of 8
2. (increase_rate c7)
   changed: (rate_value c7) from 0 to 1
   goals met: 4 of 8
3. (increase_rate c7)
   changed: (rate_value c7) from 1 to 2
   goals met: 4 of 8
4. (increase_rate c7)
   changed: (rate_value c7) from 2 to 3
   goals met: 4 of 8
5. (increase_rate c7)
   changed: (rate_value c7) from 3 to 4
   goals met: 4 of 8
6. (increase_rate c7)
   changed: (rate_value c7) from 4 to 5
   goals met: 4 of 8
7. (increase_rate c6)
   changed: (rate_value c6) from 1 to 2
   goals met: 4 of 8
8. (increase_rate c6)
   changed: (rate_value c6) from 2 to 3
   goals met: 4 of 8
9. (increase_rate c6)
   changed: (rate_value c6) from 3 to 4
   goals met: 4 of 8
10. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 4 of 8
11. (increment c6)
   changed: (value c6) from 61 to 65
   goals met: 5 of 8
12. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 5 of 8
13. (decrement_rate c2)
   changed: (rate_value c2) from 1 to 0
   goals met: 5 of 8
14. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 5 of 8
15. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 5 of 8
16. (increase_rate c1)
   changed: (rate_value c1) from 3 to 4
   goals met: 5 of 8
17. (increase_rate c1)
   changed: (rate_value c1) from 4 to 5
   goals met: 5 of 8
18. (increment c7)
   changed: (value c7) from 23 to 28
   goals met: 5 of 8
19. (increment c7)
   changed: (value c7) from 28 to 33
   goals met: 5 of 8
20. (decrement c1)
   changed: (value c1) from 49 to 44
   goals met: 5 of 8
21. (decrement c1)
   changed: (value c1) from 44 to 39
   goals met: 5 of 8
22. (increase_rate c1)
   changed: (rate_value c1) from 5 to 6
   goals met: 5 of 8
23. (decrement c1)
   changed: (value c1) from 39 to 33
   goals met: 5 of 8
24. (decrement c1)
   changed: (value c1) from 33 to 27
   goals met: 6 of 8
25. (increase_rate c7)
   changed: (rate_value c7) from 5 to 6
   goals met: 6 of 8
26. (increment c7)
   changed: (value c7) from 33 to 39
   goals met: 6 of 8
27. (increment c7)
   changed: (value c7) from 39 to 45
   goals met: 6 of 8
28. (increment c7)
   changed: (value c7) from 45 to 51
   goals met: 6 of 8
29. (increment c7)
   changed: (value c7) from 51 to 57
   goals met: 6 of 8
30. (increment c7)
   changed: (value c7) from 57 to 63
   goals met: 6 of 8
31. (increment c7)
   changed: (value c7) from 63 to 69
   goals met: 7 of 8
32. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 7 of 8
33. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 7 of 8
34. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 7 of 8
35. (increase_rate c3)
   changed: (rate_value c3) from 3 to 4
   goals met: 7 of 8
36. (increase_rate c3)
   changed: (rate_value c3) from 4 to 5
   goals met: 7 of 8
37. (increase_rate c3)
   changed: (rate_value c3) from 5 to 6
   goals met: 7 of 8
38. (increment c3)
   changed: (value c3) from 0 to 6
   goals met: 7 of 8
39. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 7 of 8
40. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 7 of 8
41. (increment c3)
   changed: (value c3) from 6 to 12
   goals met: 7 of 8
42. (increase_rate c3)
   changed: (rate_value c3) from 6 to 7
   goals met: 7 of 8
43. (increase_rate c3)
   changed: (rate_value c3) from 7 to 8
   goals met: 7 of 8
44. (increment c3)
   changed: (value c3) from 12 to 20
   goals met: 6 of 8
45. (increment c3)
   changed: (value c3) from 20 to 28
   goals met: 6 of 8
46. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 6 of 8
47. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 6 of 8
48. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 6 of 8
49. (increment c4)
   changed: (value c4) from 18 to 21
   goals met: 6 of 8
50. (increment c4)
   changed: (value c4) from 21 to 24
   goals met: 6 of 8
51. (increment c4)
   changed: (value c4) from 24 to 27
   goals met: 6 of 8
52. (increment c4)
   changed: (value c4) from 27 to 30
   goals met: 7 of 8
53. (decrement c2)
   changed: (value c2) from 29 to 27
   goals met: 7 of 8
54. (decrement c1)
   changed: (value c1) from 27 to 21
   goals met: 8 of 8
